-- 创建云记账数据
CREATE DATABASE cloudaccount;

/* 
  创建记账表
  id 主键
  分类名称
  金额
  账户
  创建时间
  描述
*/
CREATE TABLE account(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  aflname VARCHAR(200),
  amoney DOUBLE,
  azhanghu VARCHAR(100),
  acreatetime DATE,
  adesc VARCHAR(1000)
);

-- 添加数据
INSERT  INTO account(aid,aflname,amoney,azhanghu,acreatetime,adesc) VALUES (1,'吃饭支出',247,'交通银行','2017-03-02','家庭聚餐'),
(2,'工资收入',12345,'现金','2017-03-15','开工资了'),
(3,'服装支出',1998,'现金','2017-04-02','买衣服'),
(4,'吃饭支出',325,'现金','2017-06-18','朋友聚餐'),
(5,'股票收入',8000,'工商银行','2017-10-28','股票大涨'),
(6,'股票收入',5000,'工商银行','2017-10-28','股票又大涨'),
(7,'工资收入',5000,'交通银行','2017-10-28','又开工资了'),
(8,'礼金支出',5000,'现金','2017-10-28','朋友结婚'),
(9,'其他支出',1560,'现金','2017-10-29','丢钱了'),
(10,'交通支出',2300,'交通银行','2017-10-29','油价还在涨啊'),
(11,'吃饭支出',1000,'工商银行','2017-10-29','又吃饭'),
(12,'工资收入',1000,'现金','2017-10-30','开资'),
(13,'交通支出',2000,'现金','2017-10-30','机票好贵'),
(14,'工资收入',5000,'现金','2017-10-30','又开资')





